case3/TemplateCase-0.075/0/C
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
2500
(
(-0.492203 -0.245228 0.005)
(-0.472113 -0.245228 0.005)
(-0.452023 -0.245228 0.005)
(-0.431933 -0.245228 0.005)
(-0.411843 -0.245228 0.005)
(-0.391753 -0.245228 0.005)
(-0.371663 -0.245228 0.005)
(-0.351573 -0.245228 0.005)
...
)
;

boundaryField
{
    left
    {
        type            calculated;
        value           nonuniform List<vector> 
50
(
(-0.502244 -0.245235 0.005)
(-0.506726 -0.235702 0.005)
(-0.511188 -0.226159 0.005)
(-0.515617 -0.216601 0.005)
(-0.519999 -0.207022 0.005)
(-0.524321 -0.197415 0.005)
(-0.528569 -0.187775 0.005)
(-0.532728 -0.178097 0.005)
...
)
;
    }
    right
    {
        type            calculated;
        value           nonuniform List<vector> 
50
(
(0.502244 -0.245235 0.005)
(0.506726 -0.235702 0.005)
(0.511188 -0.226159 0.005)
(0.515617 -0.216601 0.005)
(0.519999 -0.207022 0.005)
(0.524321 -0.197415 0.005)
(0.528569 -0.187775 0.005)
(0.532728 -0.178097 0.005)
...
)
;
    }
    up
    {
        type            calculated;
        value           nonuniform List<vector> 
50
(
(-0.49 0.25 0.005)
(-0.47 0.25 0.005)
(-0.45 0.25 0.005)
(-0.43 0.25 0.005)
(-0.41 0.25 0.005)
(-0.39 0.25 0.005)
(-0.37 0.25 0.005)
(-0.35 0.25 0.005)
...
)
;
    }
    down
    {
        type            calculated;
        value           nonuniform List<vector> 
50
(
(-0.49 -0.25 0.005)
(-0.47 -0.25 0.005)
(-0.45 -0.25 0.005)
(-0.43 -0.25 0.005)
(-0.41 -0.25 0.005)
(-0.39 -0.25 0.005)
(-0.37 -0.25 0.005)
(-0.35 -0.25 0.005)
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
